src/cf/Documents/уатВыдачаРасходныхМатериалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>уатВыдачаРасходныхМатериалов</Name>
			<BasedOn>
				<xr:Item>Document.уатЗаявкаНаРемонт</xr:Item>
				<xr:Item>Document.уатПоступлениеТоваровУслуг</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.уатПартииТоваровНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.уатТоварыВЯчейках</xr:Item>
				<xr:Item>AccumulationRegister.уатРасходы</xr:Item>
				<xr:Item>AccumulationRegister.уатНоменклатураТС</xr:Item>
				<xr:Item>InformationRegister.уатДатыДвиженияТоваровНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.уатСпецодеждаИИнструментыСотрудников</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатВидыОперацийВыдачаРасходныхМатериалов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уатЗаявкаНаРемонт</v8:Type>
						<v8:Type>cfg:DocumentRef.уатПоступлениеТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Comment>Склад, с которого берутся агрегаты</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кладовщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Механик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПланыПримененияЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВключаетНДС</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьНДС</Name>
					<Comment>Учитывать НДС</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>Номенклатура</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>Количество</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Comment>Единица измерения</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТС</Name>
							<Comment>Транспортное средство</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Водитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Comment>Служебный реквизит отражающий сумму в валюте регл учета</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Comment>Сумма НДС</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/AccumulationRegisters/уатПартииТоваровНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>уатПартииТоваровНаСкладах</Name>
			<Comment>Партии товаров на складах  (уат)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Comment>Стоимость в валюте регламентированного учета без НДС</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьУпр</Name>
					<Comment>Стоимость в валюте управленческого учета без НДС</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Comment>Сумма НДС в регл. валюте</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уатОприходованиеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.уатВводОстатков</v8:Type>
						<v8:Type>cfg:DocumentRef.уатАвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.уатОперацииСТехническимиЖидкостями</v8:Type>
						<v8:Type>cfg:DocumentRef.уатПоступлениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.уатСливГСМ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/AccumulationRegisters/уатТоварыВЯчейках.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>уатТоварыВЯчейках</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ячейка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатСкладскиеЯчейки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/InformationRegisters/уатКадроваяИсторияСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>уатКадроваяИсторияСотрудников</Name>
			<Comment>(уат)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Календари</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьНачислятьЗПВПЛ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКласс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПозывной</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/уатВидыОперацийВыдачаРасходныхМатериалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатВидыОперацийВыдачаРасходныхМатериалов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СписаниеНаТС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеНаПрочиеРасходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеВПроизводство</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/уатВидыЗатрат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатВидыЗатрат</Name>
			<Comment>(уат)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Амортизация</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГСМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТЖ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаТруда</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ремонт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Шины</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформлениеДокументов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочие</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаРасходныхМатериалов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеАгрегатов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеМатериаловНаПрочиеРасходы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Documents/уатВыдачаРасходныхМатериалов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки	 - Структура - настройки подсистемы.
//
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
	Настройки.ПриПолученииСлужебныхРеквизитов = Ложь;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// СтандартныеПодсистемы.Печать

// Заполняет список команд печати.
//
// Параметры:
//  КомандыПечати	 - ТаблицаЗначений	 - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.уатВыдачаРасходныхМатериалов";
	КомандаПечати.Идентификатор = "РаздаточнаяВедомостьНаТС";
	КомандаПечати.Представление = НСтр("en='Payroll on vehicle';ru='Раздаточная ведомость на ТС'");
	
	// Реестр документов
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор  = "Реестр";
	КомандаПечати.Представление  = НСтр("en='Document register';ru='Реестр документов'");
	КомандаПечати.ЗаголовокФормы = НСтр("en='Register of documents ""Issue of consumables""';ru='Реестр документов ""Выдача расходных материалов""'");
	КомандаПечати.Обработчик     = "уатОбщегоНазначенияТиповыеКлиент.ВыполнитьКомандуПечатиРеестраДокументов";
	КомандаПечати.СписокФорм     = "ФормаСписка";
	КомандаПечати.Порядок        = 100;
	
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр).
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой был выведен объект (выходной
//                                                            параметр);
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов (выходной
//                                            параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если НЕ уатОбщегоНазначенияСервер.РазрешениеПечатиНепроведенногоДокумента(МассивОбъектов) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "РаздаточнаяВедомостьНаТС") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "РаздаточнаяВедомостьНаТС",
			"Раздаточная ведомость на ТС", ПечатьРаздаточнаяВедомостьНаТС(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
	
	уатОбщегоНазначенияСервер.УстановитьРедактированиеПечатныхФормДокумента(КоллекцияПечатныхФорм);
	
КонецПроцедуры

// Получает дополнительные реквизиты для отображения в отчете "Реестр документов"
// 
// Возвращаемое значение:
//  Структура - доп. реквизитов
//
Функция ПолучитьДополнительныеРеквизитыДляРеестра() Экспорт
	
	Результат = Новый Структура("Информация", "Склад");
	Возврат Результат;
	
КонецФункции

// Конец СтандартныеПодсистемы.Печать

// СтандартныеПодсистемы.УправлениеДоступом

// Позволяет переопределить ограничение, указанное в модуле менеджера объекта метаданных.
//
// Параметры:
//  Ограничение - Структура:
//    * Текст                             - Строка - ограничение доступа для пользователей.
//                                          Если пустая строка, значит, доступ разрешен.
//    * ТекстДляВнешнихПользователей      - Строка - ограничение доступа для внешних пользователей.
//                                          Если пустая строка, значит, доступ запрещен.
//    * ПоВладельцуБезЗаписиКлючейДоступа - Неопределено - определить автоматически.
//                                        - Булево - если Ложь, то всегда записывать ключи доступа,
//                                          если Истина, тогда не записывать ключи доступа,
//                                          а использовать ключи доступа владельца (требуется,
//                                          чтобы ограничение было строго по объекту-владельцу).
//   * ПоВладельцуБезЗаписиКлючейДоступаДляВнешнихПользователей - Неопределено, Булево - также
//                                          как у параметра ПоВладельцуБезЗаписиКлючейДоступа.
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)
	|	И ЗначениеРазрешено(Подразделение)";
	
	Ограничение.ТекстДляВнешнихПользователей = Ограничение.Текст;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	
	ВалютаРеглКомпании = Константы.ВалютаРегламентированногоУчета.Получить();
	ВалютаРегл = уатОбщегоНазначенияТиповые.ВалютаРегламентированногоУчета(ДокументСсылка.Организация);
	
	мЗапрос = Новый Запрос;
	мЗапрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаДокумента.Ссылка КАК Регистратор,
	|	ТаблицаДокумента.Ссылка.Дата КАК Период,
	|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
	|	ТаблицаДокумента.Ссылка.Склад КАК Склад,
	|	ТаблицаДокумента.Ссылка.Склад.ТранзитнаяЯчейка КАК Ячейка,
	|	ТаблицаДокумента.Номенклатура КАК Номенклатура,
	|	ТаблицаДокумента.ТС КАК ТС,
	|	ТаблицаДокумента.Водитель КАК Водитель,
	|	ТаблицаДокумента.Количество * ЕСТЬNULL(ТаблицаДокумента.ЕдиницаИзмерения.Коэффициент, 1) / ТаблицаДокумента.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК Количество,
	|	ТаблицаДокумента.Сумма КАК Стоимость,
	|	0 КАК СтоимостьУпр,
	|	0 КАК СуммаНДС
	|ИЗ
	|	Документ.уатВыдачаРасходныхМатериалов.Материалы КАК ТаблицаДокумента
	|ГДЕ
	|	ТаблицаДокумента.Ссылка = &Ссылка";
	
	мЗапрос.УстановитьПараметр("Ссылка",ДокументСсылка);
	ТаблицаДокумента = мЗапрос.Выполнить().Выгрузить();
	
	флЯчеистыйСклад = ПолучитьФункциональнуюОпцию("уатАдресноеХранение") = ИСТИНА
		И ДокументСсылка.Склад.АдресноеХранение;
		
	// управляемая блокировка
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.уатПартииТоваровНаСкладах");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = ТаблицаДокумента;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Склад", "Склад");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");
	Если флЯчеистыйСклад Тогда 
		ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.уатТоварыВЯчейках");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.ИсточникДанных = ТаблицаДокумента;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Склад", "Склад");
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Ячейка", "Ячейка");
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");
	КонецЕсли;
	Блокировка.Заблокировать();
	
	ТаблицаПартий = уатПроведение.ПолучитьТаблицуПартийДляСписания(
		ТаблицаДокумента,
		СтруктураДополнительныеСвойства.ДляПроведения.МоментКонтроля,
		ДокументСсылка.Организация);
		
	ТаблицаПартий.Колонки.Добавить("ОсталосьКол");
	ТаблицаПартий.Колонки.Добавить("ОсталосьСтоимость");
	ТаблицаПартий.Колонки.Добавить("ОсталосьСтоимостьУпр");
	ТаблицаПартий.Колонки.Добавить("ОсталосьСуммаНДС");
	Для каждого ТекСтрокаПартий ИЗ ТаблицаПартий Цикл
		ТекСтрокаПартий.ОсталосьКол          = ТекСтрокаПартий.Количество;
		ТекСтрокаПартий.ОсталосьСтоимость    = ТекСтрокаПартий.Стоимость;
		ТекСтрокаПартий.ОсталосьСтоимостьУпр = ТекСтрокаПартий.СтоимостьУпр;
		ТекСтрокаПартий.ОсталосьСуммаНДС     = ТекСтрокаПартий.СуммаНДС;
	КонецЦикла;
	Для каждого ТекСтрокаДокумента ИЗ ТаблицаДокумента Цикл
		СписатьСтоимость    = 0;
		СписатьСтоимостьУпр = 0;
		СписатьСуммаНДС     = 0;
		ОсталосьСписать     = ТекСтрокаДокумента.Количество;
		
		Для каждого ТекСтрокаПартий Из ТаблицаПартий Цикл
			Если ТекСтрокаПартий.Номенклатура <> ТекСтрокаДокумента.Номенклатура 
			 ИЛИ ТекСтрокаПартий.ОсталосьКол = 0 тогда
				Продолжить;
			КонецЕсли;
			Если ОсталосьСписать = 0 тогда
				Прервать;
			КонецЕсли;
			СписатьКол = Мин(ТекСтрокаПартий.ОсталосьКол, ОсталосьСписать);
			Если СписатьКол = ТекСтрокаПартий.ОсталосьКол тогда
				СписатьСтоимость    = СписатьСтоимость    + ТекСтрокаПартий.ОсталосьСтоимость;
				СписатьСтоимостьУпр = СписатьСтоимостьУпр + ТекСтрокаПартий.ОсталосьСтоимостьУпр;
				СписатьСуммаНДС     = СписатьСуммаНДС     + ТекСтрокаПартий.ОсталосьСуммаНДС;
			Иначе
				СписатьСтоимость    = СписатьСтоимость    + Окр(ТекСтрокаПартий.ОсталосьСтоимость    / ТекСтрокаПартий.ОсталосьКол * СписатьКол,2);
				СписатьСтоимостьУпр = СписатьСтоимостьУпр + Окр(ТекСтрокаПартий.ОсталосьСтоимостьУпр / ТекСтрокаПартий.ОсталосьКол * СписатьКол,2);
				СписатьСуммаНДС     = СписатьСуммаНДС     + Окр(ТекСтрокаПартий.ОсталосьСуммаНДС     / ТекСтрокаПартий.ОсталосьКол * СписатьКол,2);
			КонецЕсли;
			ТекСтрокаПартий.ОсталосьКол          = ТекСтрокаПартий.ОсталосьКол          - СписатьКол;
			ТекСтрокаПартий.ОсталосьСтоимость    = ТекСтрокаПартий.ОсталосьСтоимость    - СписатьСтоимость;
			ТекСтрокаПартий.ОсталосьСтоимостьУпр = ТекСтрокаПартий.ОсталосьСтоимостьУпр - СписатьСтоимостьУпр;
			ТекСтрокаПартий.ОсталосьСуммаНДС     = ТекСтрокаПартий.ОсталосьСуммаНДС     - СписатьСуммаНДС;
			ОсталосьСписать = ОсталосьСписать - СписатьКол;
		КонецЦикла;
		
		ТекСтрокаДокумента.СтоимостьУпр = СписатьСтоимостьУпр;
		ТекСтрокаДокумента.Стоимость    = СписатьСтоимость;
		ТекСтрокаДокумента.СуммаНДС     = СписатьСуммаНДС;
		
		// пересчет суммы партий в валюту регл. учета организации документа
		Если ВалютаРеглКомпании <> ВалютаРегл Тогда
			Для Каждого ТекСтрокаДокумента Из ТаблицаДокумента Цикл
				ТекСтрокаДокумента.Стоимость = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(ТекСтрокаДокумента.Стоимость,
					ВалютаРеглКомпании, ВалютаРегл, ДокументСсылка.Дата, ДокументСсылка.Дата,,,,
					ДокументСсылка);
				ТекСтрокаДокумента.СуммаНДС = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(ТекСтрокаДокумента.СуммаНДС,
					ВалютаРеглКомпании, ВалютаРегл, ДокументСсылка.Дата, ДокументСсылка.Дата,,,,
					ДокументСсылка);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
		
	ТаблицаНоменклатурыТС = ТаблицаДокумента.Скопировать();
		
	ЗапросПартии = Новый Запрос();
	ЗапросПартии.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТабДанных.Организация КАК Организация,
	|	ТабДанных.Склад КАК Склад,
	|	ТабДанных.Номенклатура КАК Номенклатура,
	|	ТабДанных.Партия КАК Партия,
	|	ТабДанных.Количество КАК Количество,
	|	ТабДанных.Стоимость КАК Стоимость,
	|	ТабДанных.СтоимостьУпр КАК СтоимостьУпр,
	|	ТабДанных.СуммаНДС КАК СуммаНДС
	|ПОМЕСТИТЬ ВремТаблицаПартий
	|ИЗ
	|	&ТаблицаПарам КАК ТабДанных
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	&Период КАК Период,
	|	&Регистратор КАК Регистратор,
	|	ТабДанных.Организация КАК Организация,
	|	ТабДанных.Склад КАК Склад,
	|	ТабДанных.Партия КАК Партия,
	|	ТабДанных.Номенклатура КАК Номенклатура,
	|	ТабДанных.Количество КАК Количество,
	|	ТабДанных.Стоимость КАК Стоимость,
	|	ТабДанных.СтоимостьУпр КАК СтоимостьУпр,
	|	ТабДанных.СуммаНДС КАК СуммаНДС
	|ИЗ
	|	ВремТаблицаПартий КАК ТабДанных";
	
	ЗапросПартии.УстановитьПараметр("Период"         , ДокументСсылка.Дата);
	ЗапросПартии.УстановитьПараметр("ТаблицаПарам"   , ТаблицаПартий);
	ЗапросПартии.УстановитьПараметр("Регистратор"    , ДокументСсылка);
	
	МассивРезультатов = ЗапросПартии.ВыполнитьПакет();
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПартии", МассивРезультатов[1].Выгрузить());
	
	Если флЯчеистыйСклад Тогда
		ЗапросЯчейки = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	ТаблицаДокумента.Ссылка.Дата КАК Период,
		|	ТаблицаДокумента.Ссылка КАК Регистратор,
		|	ТаблицаДокумента.Ссылка.Склад КАК Склад,
		|	ТаблицаДокумента.Ссылка.Склад.ТранзитнаяЯчейка КАК Ячейка,
		|	ТаблицаДокумента.Номенклатура КАК Номенклатура,
		|	ТаблицаДокумента.Количество * ЕСТЬNULL(ТаблицаДокумента.ЕдиницаИзмерения.Коэффициент, 1) / ТаблицаДокумента.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК Количество
		|ИЗ
		|	Документ.уатВыдачаРасходныхМатериалов.Материалы КАК ТаблицаДокумента
		|ГДЕ
		|	ТаблицаДокумента.Ссылка = &Ссылка");
		ЗапросЯчейки.УстановитьПараметр("Ссылка", ДокументСсылка);
		тблТоварыВЯчейках = ЗапросЯчейки.Выполнить().Выгрузить(); 
		
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаТоварыВЯчейках", тблТоварыВЯчейках);
	КонецЕсли;

	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДокумента"     , ТаблицаДокумента);
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаНоменклатурыТС", ТаблицаНоменклатурыТС);
	
	Если ДокументСсылка.ВидОперации <> Перечисления.уатВидыОперацийВыдачаРасходныхМатериалов.СписаниеВПроизводство
		И ПолучитьФункциональнуюОпцию("уатИспользоватьУчетДоходовИРасходов") = ИСТИНА Тогда
		
		СтатьяРасходовРемонт = Неопределено;
		Если ДокументСсылка.ВидОперации = Перечисления.уатВидыОперацийВыдачаРасходныхМатериалов.СписаниеНаПрочиеРасходы Тогда
			ВидЗатратВыдачаРасходныхМатериалов = Перечисления.уатВидыЗатрат.СписаниеМатериаловНаПрочиеРасходы;
		Иначе
			ВидЗатратВыдачаРасходныхМатериалов = Перечисления.уатВидыЗатрат.ВыдачаРасходныхМатериалов;
		КонецЕсли;
		
		Для Каждого ТекСтрока Из ДокументСсылка.ПланЗатрат.Расходы Цикл
			Если СтатьяРасходовРемонт = Неопределено
				И ВидЗатратВыдачаРасходныхМатериалов <> Неопределено
				И ТекСтрока.СтатьяРасходов.ВидЗатрат = ВидЗатратВыдачаРасходныхМатериалов Тогда
				СтатьяРасходовРемонт = ТекСтрока.СтатьяРасходов;
			КонецЕсли;
		КонецЦикла;
		
		ТаблицаРасходы = Новый ТаблицаЗначений;
		ТаблицаРасходы.Колонки.Добавить("СтатьяРасходов", Новый ОписаниеТипов("СправочникСсылка.уатСтатьиРасходов"));
		ТаблицаРасходы.Колонки.Добавить("СчетЗатрат", Новый ОписаниеТипов("ПланСчетовСсылка.уатРегламентированный"));
		ТаблицаРасходы.Колонки.Добавить("СуммаРегл", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(15, 2)));
		ТаблицаРасходы.Колонки.Добавить("СуммаУпр", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(15, 2)));
		ТаблицаРасходы.Колонки.Добавить("СуммаНДС", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(15, 2)));
		ТаблицаРасходы.Колонки.Добавить("СуммаНДСУпр", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(15, 2)));
		ТаблицаРасходы.Колонки.Добавить("ТС", Новый ОписаниеТипов("СправочникСсылка.уатТС"));
		
		Для Каждого ТекСтрока Из СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаНоменклатурыТС Цикл
			СтатьяРасходовНоменклатуры = уатОбщегоНазначенияСервер.СтатьяРасходовНоменклатуры(ТекСтрока.Номенклатура, Ложь);
			ТекСтатьяРасходов = ?(ЗначениеЗаполнено(СтатьяРасходовНоменклатуры), СтатьяРасходовНоменклатуры, СтатьяРасходовРемонт);
			Если НЕ ЗначениеЗаполнено(ТекСтатьяРасходов) Тогда
				Продолжить;
			КонецЕсли;
			
			ТекСуммаНДСУпр = ?(ТекСтрока.Стоимость = 0, 0, ТекСтрока.СуммаНДС * ТекСтрока.СтоимостьУпр / ТекСтрока.Стоимость);
			
			НоваяСтрокаВрем                = ТаблицаРасходы.Добавить();
			НоваяСтрокаВрем.СтатьяРасходов = ТекСтатьяРасходов;
			НоваяСтрокаВрем.СчетЗатрат     = ТекСтатьяРасходов.Счет;
			НоваяСтрокаВрем.СуммаРегл      = ТекСтрока.Стоимость + ТекСтрока.СуммаНДС;
			НоваяСтрокаВрем.СуммаУпр       = ТекСтрока.СтоимостьУпр + ТекСуммаНДСУпр;
			НоваяСтрокаВрем.СуммаНДС       = ТекСтрока.СуммаНДС;
			НоваяСтрокаВрем.СуммаНДСУпр    = ТекСуммаНДСУпр;
			НоваяСтрокаВрем.ТС             = ТекСтрока.ТС;
		КонецЦикла;
			
		ТаблицаРасходы.Свернуть("СтатьяРасходов, СчетЗатрат, ТС", "СуммаРегл, СуммаУпр, СуммаНДС, СуммаНДСУпр");
		
		ТаблицаРасходы.Колонки.Добавить("Период");
		ТаблицаРасходы.ЗаполнитьЗначения(ДокументСсылка.Дата, "Период");
		ТаблицаРасходы.Колонки.Добавить("Регистратор");
		ТаблицаРасходы.ЗаполнитьЗначения(ДокументСсылка, "Регистратор");
		ТаблицаРасходы.Колонки.Добавить("Организация");
		ТаблицаРасходы.ЗаполнитьЗначения(ДокументСсылка.Организация, "Организация");
		ТаблицаРасходы.Колонки.Добавить("Подразделение");
		ТаблицаРасходы.ЗаполнитьЗначения(ДокументСсылка.Подразделение, "Подразделение");
		
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасходы", ТаблицаРасходы);
	КонецЕсли;
	
	ЗапросСпецодежда = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаДокумента.Водитель КАК Сотрудник,
	|	ВЫРАЗИТЬ(ТаблицаДокумента.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	|	ТаблицаДокумента.Количество КАК Количество,
	|	ТаблицаДокумента.СтоимостьУпр КАК Стоимость
	|ПОМЕСТИТЬ ВремТаблицаДокумента
	|ИЗ
	|	&ТаблицаДокумента КАК ТаблицаДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	&Период КАК Период,
	|	&Регистратор КАК Регистратор,
	|	&Период КАК ДатаВыдачи,
	|	ВремТаблицаДокумента.Сотрудник КАК Сотрудник,
	|	уатКадроваяИсторияСотрудников.Должность КАК Должность,
	|	ВремТаблицаДокумента.Номенклатура КАК Номенклатура,
	|	ВремТаблицаДокумента.Количество КАК Количество,
	|	ВремТаблицаДокумента.Стоимость КАК Стоимость
	|ПОМЕСТИТЬ ВремТаблицаДвижений
	|ИЗ
	|	ВремТаблицаДокумента КАК ВремТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уатКадроваяИсторияСотрудников.СрезПоследних(&Период, Организация = &Организация) КАК уатКадроваяИсторияСотрудников
	|		ПО ВремТаблицаДокумента.Сотрудник = уатКадроваяИсторияСотрудников.Сотрудник
	|ГДЕ
	|	ВремТаблицаДокумента.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.СпецодеждаИИнструменты)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ВремТаблицаДвижений.Период КАК Период,
	|	ВремТаблицаДвижений.Регистратор КАК Регистратор,
	|	ВремТаблицаДвижений.ДатаВыдачи КАК ДатаВыдачи,
	|	ВремТаблицаДвижений.Сотрудник КАК Сотрудник,
	|	ВремТаблицаДвижений.Должность КАК Должность,
	|	ВремТаблицаДвижений.Номенклатура КАК Номенклатура,
	|	ВремТаблицаДвижений.Количество КАК Количество,
	|	ВремТаблицаДвижений.Стоимость КАК Стоимость,
	|	ВЫБОР
	|		КОГДА ВремТаблицаДвижений.Номенклатура.МодельСпецодеждыИлиИнструмента.ВозможностьВозврата
	|			ТОГДА 0
	|		ИНАЧЕ ВремТаблицаДвижений.Стоимость
	|	КОНЕЦ КАК СуммаИзноса
	|ИЗ
	|	ВремТаблицаДвижений КАК ВремТаблицаДвижений
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	ВремТаблицаДвижений.Период,
	|	ВремТаблицаДвижений.Регистратор,
	|	ВремТаблицаДвижений.ДатаВыдачи,
	|	ВремТаблицаДвижений.Сотрудник,
	|	ВремТаблицаДвижений.Должность,
	|	ВремТаблицаДвижений.Номенклатура,
	|	ВремТаблицаДвижений.Количество,
	|	ВремТаблицаДвижений.Стоимость,
	|	ВремТаблицаДвижений.Стоимость
	|ИЗ
	|	ВремТаблицаДвижений КАК ВремТаблицаДвижений
	|ГДЕ
	|	НЕ ВремТаблицаДвижений.Номенклатура.МодельСпецодеждыИлиИнструмента.ВозможностьВозврата");
	ЗапросСпецодежда.УстановитьПараметр("Период",           ДокументСсылка.Дата);
	ЗапросСпецодежда.УстановитьПараметр("Регистратор",      ДокументСсылка);
	ЗапросСпецодежда.УстановитьПараметр("Организация",      ДокументСсылка.Организация);
	ЗапросСпецодежда.УстановитьПараметр("ТаблицаДокумента", ТаблицаДокумента);
	ТаблицаСпецодежда = ЗапросСпецодежда.Выполнить().Выгрузить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСпецодеждаСотрудников", ТаблицаСпецодежда);
	
КонецПроцедуры // ИнициализироватьДанныеДокумента()

Процедура ВыполнитьКонтроль(ДокументСсылка, ДополнительныеСвойства, Отказ, УдалениеПроведения = Ложь) Экспорт
	
	Заголовок = уатОбщегоНазначенияТиповые.уатПредставлениеДокументаПриПроведении(ДокументСсылка);
	
	мЗапрос = Новый Запрос;
	мЗапрос.МенеджерВременныхТаблиц = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц; 
	мЗапрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаДокумента.Номенклатура КАК Номенклатура,
	|	ТаблицаДокумента.Ссылка КАК Регистратор,
	|	ЕСТЬNULL(уатПартииТоваровНаСкладахОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
	|	ЕСТЬNULL(уатТоварыВЯчейкахОстатки.КоличествоОстаток, 0) КАК КоличествоОстатокЯчейка
	|ИЗ
	|	Документ.уатВыдачаРасходныхМатериалов.Материалы КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.уатПартииТоваровНаСкладах.Остатки(
	|				&МоментВремени,
	|				Склад = &Склад
	|					И Номенклатура В
	|						(ВЫБРАТЬ
	|							ТабНоменклатуры.Номенклатура
	|						ИЗ
	|							Документ.уатВыдачаРасходныхМатериалов.Материалы КАК ТабНоменклатуры
	|						ГДЕ
	|							ТабНоменклатуры.Ссылка = &Ссылка)) КАК уатПартииТоваровНаСкладахОстатки
	|		ПО ТаблицаДокумента.Номенклатура = уатПартииТоваровНаСкладахОстатки.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.уатТоварыВЯчейках.Остатки(
	|				&МоментВремени,
	|				Склад = &ЯчеистыйСклад
	|					И Ячейка = Склад.ТранзитнаяЯчейка
	|					И Номенклатура В
	|						(ВЫБРАТЬ
	|							ТабНоменклатуры.Номенклатура
	|						ИЗ
	|							Документ.уатВыдачаРасходныхМатериалов.Материалы КАК ТабНоменклатуры
	|						ГДЕ
	|							ТабНоменклатуры.Ссылка = &Ссылка)) КАК уатТоварыВЯчейкахОстатки
	|		ПО ТаблицаДокумента.Номенклатура = уатТоварыВЯчейкахОстатки.Номенклатура
	|ГДЕ
	|	ТаблицаДокумента.Ссылка = &Ссылка
	|	И (ЕСТЬNULL(уатПартииТоваровНаСкладахОстатки.КоличествоОстаток, 0) < 0
	|			ИЛИ ЕСТЬNULL(уатТоварыВЯчейкахОстатки.КоличествоОстаток, 0) < 0)";
	
	мЗапрос.УстановитьПараметр("Склад"        , ДокументСсылка.Склад);
	мЗапрос.УстановитьПараметр("ЯчеистыйСклад", ДокументСсылка.Склад);
	мЗапрос.УстановитьПараметр("Ссылка"       , ДокументСсылка);
	мЗапрос.УстановитьПараметр("МоментВремени", ДополнительныеСвойства.ДляПроведения.МоментКонтроля);
	
	Если уатОбщегоНазначения.УчетнаяПолитика(ДокументСсылка.Организация,
		ДополнительныеСвойства.ДляПроведения.МоментКонтроля).УчетПартийПоОрганизациям Тогда
		мЗапрос.Текст = СтрЗаменить(мЗапрос.Текст, "Склад = &Склад", "Склад = &Склад И Организация = &Организация");
		мЗапрос.УстановитьПараметр("Организация", ДокументСсылка.Организация);
	КонецЕсли;
	
	Выборка = мЗапрос.Выполнить().Выбрать();
	
	Если ПолучитьФункциональнуюОпцию("уатАдресноеХранение") И ДокументСсылка.Склад.АдресноеХранение Тогда
		ТекстШаблона = "Обнаружен отрицательный остаток номенклатуры ""%1"" на складе ""%2"" (транзитная ячейка): %3";
	Иначе
		ТекстШаблона = "Обнаружен отрицательный остаток номенклатуры ""%1"" на складе ""%2"": %3";
	КонецЕсли;
	
	Если Выборка.Количество() тогда
		Пока Выборка.Следующий() Цикл
			ТекстНСТР = СтрШаблон(ТекстШаблона, Выборка.Номенклатура, мЗапрос.Параметры.Склад,
				Мин(Выборка.КоличествоОстаток, Выборка.КоличествоОстатокЯчейка));
			уатОбщегоНазначенияТиповые.СообщитьОбОшибке(ТекстНСТР, Отказ, Заголовок);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Функция ПечатьРаздаточнаяВедомостьНаТС(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_ВыдачаРасходныхМатериалов";
	
	ПервыйДокумент = Истина;
	Для Каждого ТекущийДокумент Из МассивОбъектов Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
				
		мВалютаРегламентированногоУчета = уатОбщегоНазначенияТиповые.ВалютаРегламентированногоУчета(ТекущийДокумент.Организация);
	
		ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ВыдачаРасходныхМатериалов";
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.уатВыдачаРасходныхМатериалов.ПФ_MXL_РаздаточнаяВедомостьНаТС");
		
		// Печать штрихкода
		Если уатЗащищенныеФункцииСервер_проф.ИспользоватьШтрихкодированиеОбъекта(ТекущийДокумент) Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("ЗаголовокШтрихкод");
			уатЗащищенныеФункцииСервер_проф.ОтобразитьШКнаПФ(ОбластьМакета, ТекущийДокумент);
			ТабличныйДокумент.Вывести(ОбластьМакета);
		КонецЕсли;
		
		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		ОбластьМакета.Параметры.ТекстЗаголовка = уатОбщегоНазначенияТиповые.уатСформироватьЗаголовокДокумента(ТекущийДокумент, "Выдача расходных материалов");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Поставщик");
		ОбластьМакета.Параметры.Склад = ТекущийДокумент.Склад;
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы");
		ОбластьСтроки = Макет.ПолучитьОбласть("Строка");
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		НомерСтроки = 0;
		Для Каждого СтрокаТабличнойЧасти Из ТекущийДокумент.Материалы Цикл	
			
			НомерСтроки = НомерСтроки + 1;
			
			ОбластьСтроки.Параметры.Заполнить(СтрокаТабличнойЧасти);
			ОбластьСтроки.Параметры.ТСПредставление = Строка(СтрокаТабличнойЧасти.ТС);
			
			ОбластьСтроки.Параметры.Сумма = СтрокаТабличнойЧасти.Сумма;
			
			ТабличныйДокумент.Вывести(ОбластьСтроки);
			
		КонецЦикла;
		
		СуммаИтого = ТекущийДокумент.Материалы.Итог("Сумма");
		
		ОбластьМакета = Макет.ПолучитьОбласть("Итого");
		ОбластьМакета.Параметры.Всего = уатОбщегоНазначенияТиповые.уатФорматСумм(СуммаИтого);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		СуммаНДС = ТекущийДокумент.Материалы.Итог("СуммаНДС");
		
		Если ТекущийДокумент.УчитыватьНДС Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("ИтогоНДС");
			Если СуммаНДС <> 0 Тогда
				ОбластьМакета.Параметры.ВсегоНДС = уатОбщегоНазначенияТиповые.уатФорматСумм(СуммаНДС);
				ОбластьМакета.Параметры.НДС      = ?(ТекущийДокумент.СуммаВключаетНДС, "В том числе НДС:", " Сумма НДС:");
			Иначе
				ОбластьМакета.Параметры.НДС = "Без налога (НДС)";
				ОбластьМакета.Параметры.ВсегоНДС = "-";
			КонецЕсли;
			ТабличныйДокумент.Вывести(ОбластьМакета);
		КонецЕсли;
		
		ОбластьМакета = Макет.ПолучитьОбласть("СуммаПрописью");
		СуммаКПрописи = СуммаИтого + ?(ТекущийДокумент.УчитыватьНДС И НЕ ТекущийДокумент.СуммаВключаетНДС, СуммаНДС, 0);
		ОбластьМакета.Параметры.ИтоговаяСтрока = "Всего выдано материалов " + НомерСтроки
		+ ", на сумму " + уатОбщегоНазначенияТиповые.уатФорматСумм(СуммаКПрописи, мВалютаРегламентированногоУчета);
		ОбластьМакета.Параметры.СуммаПрописью  = уатОбщегоНазначенияТиповые.уатСформироватьСуммуПрописью(СуммаКПрописи, мВалютаРегламентированногоУчета);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Подписи");
		ОбластьМакета.Параметры.Заполнить(ТекущийДокумент);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ТекущийДокумент);
		
	КонецЦикла;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабличныйДокумент;
	
КонецФункции // ПечатнаяФорма()

#КонецОбласти


#КонецЕсли
